app/controllers/caretakers_controller.rb

def index
@caretakers=Caretaker.all
---
SELECT `caretakers`.* FROM `caretakers`

def show
@caretaker = Caretaker.find(params[:id])
---
SELECT  `caretakers`.* FROM `caretakers` WHERE `caretakers`.`id` = 103 LIMIT 1